backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 32
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 32768
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      dtype: float32
      name: leaky_re_lu_1
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_1
  - class_name: Reshape
    config:
      dtype: float32
      name: reshape_1
      target_shape: !!python/tuple
      - 16
      - 16
      - 128
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_1
        - 0
        - 0
        - {}
    name: reshape_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id002 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_1
      padding: same
      strides: &id003 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - reshape_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      dtype: float32
      name: leaky_re_lu_2
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_2
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 4
      - 4
      name: conv2d_transpose_1
      output_padding: null
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_2
        - 0
        - 0
        - {}
    name: conv2d_transpose_1
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      dtype: float32
      name: leaky_re_lu_3
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_3
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 4
      - 4
      name: conv2d_transpose_2
      output_padding: null
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_3
        - 0
        - 0
        - {}
    name: conv2d_transpose_2
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      dtype: float32
      name: leaky_re_lu_4
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_4
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 4
      - 4
      name: conv2d_transpose_3
      output_padding: null
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_4
        - 0
        - 0
        - {}
    name: conv2d_transpose_3
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      dtype: float32
      name: leaky_re_lu_5
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_3
        - 0
        - 0
        - {}
    name: leaky_re_lu_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      dtype: float32
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_5
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      dtype: float32
      name: leaky_re_lu_6
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      dtype: float32
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_6
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      dtype: float32
      name: leaky_re_lu_7
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: leaky_re_lu_7
  - class_name: Conv2D
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      dtype: float32
      filters: 3
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 7
      - 7
      name: conv2d_4
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_7
        - 0
        - 0
        - {}
    name: conv2d_4
  name: model_1
  output_layers:
  - - conv2d_4
    - 0
    - 0
keras_version: 2.3.1
